[
	{
		"category": "email", 
		"owner": "org.webosinternals.patches.email-megamix", 
		"prefs": [ {
			"group": "Message View Options", 
			"restart": "app",
			"label": "Display Move to Folder Button",
			"help": "Displays a button to move an email message to another folder or label within the email directory. Be sure to restart the email application for this change to take effect.",
			"key": "moveToFolder",	
			"type": "ToggleButton",
			"value": false
		},{
			"group": "Message View Options", 
			"restart": "app",
			"label": "Display Set Flag Button",
			"help": "Displays a button to flag or star an email as being important. Be sure to restart the email application for this change to take effect.",
			"key": "setFlagButton",	
			"type": "ToggleButton",
			"value": false
		},{
			"group": "Compose View Options", 
			"restart": "app",
			"label": "Display Priority Button",
			"help": "Displays a button to mark an email as being important or urgent when sending it to others. Be sure to restart the email application for this change to take effect.",
			"key": "priorityButton",	
			"type": "ToggleButton",
			"value": false
		},{
			"group": "Compose View Options", 
			"restart": "app",
			"label": "Display Discard Draft Button",
			"help": "Displays a button to discard the current draft. After discarding, the application will return to the previously open view. Be sure to restart the email application for this change to take effect.",
			"key": "discardButton",	
			"type": "ToggleButton",
			"value": false
		},{
			"group": "Compose View Options", 
			"restart": "app",
			"label": "Display Save Draft Button",
			"help": "Displays a button to save the current draft. After saving, the draft will remain open for further editing. Be sure to restart the email application for this change to take effect.",
			"key": "saveDraftButton",	
			"type": "ToggleButton",
			"value": false
		},{
			"group": "Compose View Options", 
			"restart": "app",
			"label": "Require Send Confirmation",
			"help": "When activated, before sending a message, webOS will ask the user to confirm that they wish to send the message. Be sure to restart the email application for this change to take effect.",
			"key": "sendConfirmation",	
			"type": "ToggleButton",
			"value": false
		},{
			"group": "Compose View Options", 
			"restart": "app",
			"label": "Require Save Confirmation",
			"help": "When activated, before saving a draft, webOS will ask the user to confirm that they wish to save the draft. Be sure to restart the email application for this change to take effect.",
			"key": "saveConfirmation",	
			"type": "ToggleButton",
			"value": false
		},{
			"group": "Compose View Options", 
			"restart": "app",
			"label": "Require Discard Confirmation",
			"help": "When activated, before discarding a current draft, webOS will ask the user to confirm that they wish to discard the draft. Be sure to restart the email application for this change to take effect.",
			"key": "discardConfirmation",	
			"type": "ToggleButton",
			"value": false
		},{
			"group": "behavior", 
			"restart": "app",
			"label": "Additional Sync Times",
			"help": "Adds additional options to the email preferences for the frequency at which the application should check for new messages. Be sure to restart the email application for this change to take effect.",
			"key": "additionalSyncTimes",	
			"type": "ToggleButton",
			"value": false
		},{
			"group": "behavior", 
			"restart": "app",
			"label": "Additional Sync Days/Months",
			"help": "Adds additional options to the email preferences for the length of time email should be shown in the application. Be sure to restart the email application for this change to take effect.",
			"key": "additionalSyncWindow",	
			"type": "ToggleButton",
			"value": false
		},{
			"group": "List View Options", 
			"restart": "app",
			"label": "Display Delete All Button",
			"help": "Displays a button that will allow for the deletion of all messages within the currently selected folder. Be sure to restart the email application for this change to take effect.",
			"key": "deleteAllButton",	
			"type": "ToggleButton",
			"value": false
		},{
			"group": "List View Options", 
			"restart": "app",
			"label": "Display Mark Folder Read Button",
			"help": "Displays a button that will mark all messages within the currently selected folder as having been read. Be sure to restart the email application for this change to take effect.",
			"key": "markAllReadButton",	
			"type": "ToggleButton",
			"value": false
		},{
			"group": "Message View Options", 
			"restart": "luna",
			"label": "Swipe for Next Email",
			"help": "This activates swiping in the email app with the default setup - swiping from left to right will advance to the more recent email, while swiping from right to left will return to the less recent email.",
			"key": "previousEmailSwipeControl",	
			"type": "ToggleButton",
			"value": true
		},{
			"group": "Message View Options", 
			"restart": "luna",
			"label": "Reverse Swipe Direction",
			"help": "This reverses the direction for swiping in the email app (Swipe for Next Email must be turned on). When this tweak is turned on, swiping from right to left will now advance to the more recent email and swiping from left to right will return to the less recent email.",
			"key": "reverseSwipeControl",	
			"type": "ToggleButton",
			"value": false
		} ]
	}
]
		
